app/views/questions/_question.html.slim

          li.created-at
            = "#{time_ago_in_words(question.created_at)} atrás"
---
INSERT INTO "questions" ("created_at", "description", "topic_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-02-11 00:58:39.554543"], ["description", "Teste"], ["topic_id", 24], ["updated_at", "2015-02-11 00:58:39.554543"], ["user_id", 2]]