app/views/topics/show.html.slim

      dd.active= link_to 'Vídeos', '#topic-videos'
      - if @topic.resumes.size > 0
        dd= link_to 'Resumo', '#topic-description'
      - if @topic.exercises.size > 0
---
SELECT COUNT(*) FROM "resumes"  WHERE "resumes"."topic_id" = $1  [["topic_id", 27]]
SELECT COUNT(*) FROM "exercises"  WHERE "exercises"."topic_id" = $1  [["topic_id", 27]]

                = "/"
                = @topic.videos.size
---
SELECT "videos".* FROM "videos"  WHERE "videos"."topic_id" = $1  [["topic_id", 27]]

        .questions
          - @topic.questions.each do |q|
---
SELECT "questions".* FROM "questions"  WHERE "questions"."topic_id" = $1  [["topic_id", 27]]