app/views/courses/show.html.slim

SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1
---
  = form_tag({}, { method: :get, id: :select_course }) do
    = select_tag :course_id, options_for_select(Course.all.collect{ |c| [c.name, c.id] }, @course.try(:id)), onchange: "this.form.submit()"
.row

SELECT "topics".* FROM "topics"  WHERE "topics"."level_id" = $1  ORDER BY position ASC  [["level_id", 17]]
---
                dl.topics.tabs.vertical
                  - level.topics.each do |topic|
                    .topic-wrap