app/controllers/answer_controller.rb

SELECT  "exercises".* FROM "exercises"  WHERE "exercises"."id" = $1 LIMIT 1  [["id", 1]]
---
  def get_answer
    @exercise = Exercise.find(params[:exercise_id])