app/controllers/courses_controller.rb

  def set_course
    @course = params[:course_id].present? ? Course.find(params[:course_id]) : Course.first
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]