app/controllers/topics_controller.rb

  def set_up
    topic = Topic.find(topic_params)
    @video = topic.videos.new
    @question = Question.new
    @resume = Resume.find_by_topic_id(topic.id)
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = $1 LIMIT 1  [["id", 24]]
SELECT "videos".* FROM "videos"  WHERE "videos"."topic_id" = $1  [["topic_id", 24]]