app/controllers/videos_controller.rb

  def create

    topic = load_topics.first

    video      = topic.videos.new(video_params)
    video.user = current_user

    if video.save
---
INSERT INTO "videos" ("channel", "created_at", "description", "title", "topic_id", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["channel", "1"], ["created_at", "2015-02-14 16:29:30.131712"], ["description", "1"], ["title", "1"], ["topic_id", 46], ["updated_at", "2015-02-14 16:29:30.131712"], ["url", "1"], ["user_id", 2]]

  def upvote
    @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 14]]

  def load_topics
    if request.get? and params[:topic]
      @topics = Topic.where(id: topic_params)
---
SELECT  "topics".* FROM "topics"   ORDER BY "topics"."id" ASC LIMIT 1
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" IS NULL LIMIT 1